{
"items": [

{
"id": "1",
"start": "09.09.2012",
"startTime": "09:00",
"timestamp": "1347141632400",
"name": "Presentation Patterns and Anti-patterns",
"ingress": "A different approach to how to build presentations",
"description": "This session takes a different approach to how to build presentations, by providing patterns and anti-patterns you can use to make sure you’re getting the most leverage from your presentations. Don’t take a knife to a gunfight! The ability to create compelling presentations that explain your point is one of the things that keeps your job from disappearing.",
"place": "Gråkallen"
},

{
"id": "2",
"start": "09.09.2012",
"startTime": "09:00",
"timestamp": "1347141632400",
"name": "Presentations with JIH and keyboard",
"ingress": "A different approach to how to build presentations",
"description": "This session takes a different approach to how to build presentations, by providing patterns and anti-patterns you can use to make sure you’re getting the most leverage from your presentations. Don’t take a knife to a gunfight! The ability to create compelling presentations that explain your point is one of the things that keeps your job from disappearing.",
"place": "Torget"
},

{
"id": "3",
"start": "09.09.2012",
"startTime": "09:00",
"timestamp": "1347141632400",
"name": "Java SE 7 has been released, what about Java SE 8?",
"ingress": "Discussing changes in Java SE 8",
"description": "Java SE 7 was launched officially on 28th of July this year; the first new version of the Java platform in nearly five years. Now that various issues have been resolved, Oracle are keen to maintain the momentum of Java as a platform. In this session we'll talk briefly about Java SE 7 before discussing some of the changes being made to the JCP to provide a more transparent development of new Java specifications.",
"place": "Ringve"
},

{
"id": "4",
"start": "09.09.2012",
"startTime": "09:00",
"timestamp": "1347141632400",
"name": "Continous delivery",
"ingress": "Introducion to continous delivery by Ken Sipe",
"description": "Ken Sipe is a Technology Director with Perficient, Inc. (PRFT), an application architect, frequent technical speaker, author of several articles and courses, and software and methodology mentor. He is founder of CodeMentor, Inc., focusing on training and mentor in distributed computing technologies. Ken has delivered hundreds of private and public presentations including JavaOne, BorCon and NFJS.",
"place": "Møllenberg"
},

{
"id": "5",
"start": "09.09.2012",
"startTime": "12:00",
"timestamp": "1347141643200",
"name": "HTML 5 Fact and Fiction",
"ingress": "Web 2.0 development with the help of jQuery and Prototype",
"description": "For the last few years, the web has been all a-twitter about web 2.0 (and even the occasional reference to web 3.0.) Yes, the days of static web applications are officially over and while libraries like jQuery and Prototype make it easier to build modern applications, ultimately they are papering over issues in the web standards (and the browsers that implement them.)",
"place": "Gråkallen"
},

{
"id": "6",
"start": "09.09.2012",
"startTime": "13:00",
"timestamp": "1347141646800",
"name": "Do I still hate SOA?",
"ingress": "Strengths and weaknesses in Service Oriented Architecture",
"description": "At JavaZone 2005, I gave a talk with the title 'Why I hate SOA'. In the talk, I outlined several weaknesses with the then much-hyped term Service Oriented Architecture. Six years have passed, and I have learned much. The question is: Has SOA learned the same things?",
"place": "Gråkallen"
},

{
"id": "7",
"start": "09.09.2012",
"startTime": "14:00",
"timestamp": "1347141650400",
"name": "Comparing Asynchronous Web Techniques",
"ingress": "Pros and cons of comet, servlet 3, and websockets",
"description": "The world is all about the asynchronous web these days. There are an increasing number of options for Java developers. In this presentation we'll cover 3 such options: comet, servlet 3, and websockets. We'll look at code and discuss pros and cons of each approach.",
"place": "Gråkallen"
},

{
"id": "8",
"start": "10.09.2012",
"startTime": "09:00",
"timestamp": "1347228032400",
"name": "Workshop med Uncle Bob",
"ingress": "TDD and Extreme programming with Robert C. Martin",
"description": "Robert C. Martin - Uncle Bob - has been a software professional since 1970. In the last 35 years, he has worked in various capacities on literally hundreds of software projects. He has authored 'landmark' books on Agile Programming, Extreme Programming, UML, Object-Oriented Programming, and C   Programming.",
"place": "Gråkallen"
},

{
"id": "9",
"start": "10.09.2012",
"startTime": "12:00",
"timestamp": "1347228043200",
"name": "Workshop med Kent Beck",
"ingress": "Kent Beck was one of the 17 original signatories of the Agile Manifesto in 2001",
"description": "Kent Beck is an American software engineer and the creator of the Extreme Programming[1] and Test Driven Development software development methodologies, also named agile software development. Beck was one of the 17 original signatories of the Agile Manifesto in 2001.",
"place": "Gråkallen"
},

{
"id": "10",
"start": "11.09.2012",
"startTime": "09:00",
"timestamp": "1347314432400",
"name": "Avslutning",
"ingress": "Siste dag på seminaret!",
"description": "Vi oppsummerer",
"place": "Gråkallen"}
]
}